Revit 2017 API
BasePoint Class
Represents kinds of BasePoints.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
public class BasePoint : Element
Visual Basic
Public Class BasePoint _
	Inherits Element
Visual C++
public ref class BasePoint : public Element
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.BasePoint
See Also
BasePoint Members
Autodesk.Revit.DB Namespace